mdhardenburgh/Blinky/Packages/.cache/NXP.LPC54101_DFP.12.0.0.pdsc
    <condition id="device.LPC54101_AND_component.serial_manager_uart_AND_component.vusart_adapter_AND_device.LPC54101_startup_AND_driver.clock_AND_driver.common_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.vusart_AND_utility.debug_console">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="vusart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC54101_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.common">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54101_AND_component.lists_AND_driver.common">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.vusart">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.common_AND_driver.vusart">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.LPC54101_AND_CMSIS_Include_core_cm4">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.common_AND_driver.power">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54101_AND_device.LPC54101_CMSIS_AND_driver.clock_AND_driver.reset">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="Startup" Csub="LPC54101_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.common_AND_driver.inputmux_connections">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.lpc_dma_AND_driver.lpc_i2c">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.lpc_dma_AND_driver.vspi">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54101_AND_driver.lpc_dma_AND_driver.vusart">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
    </condition>
    <condition id="device.LPC54101_AND_utility.debug_console">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.LPC54101_AND_component.serial_manager_AND_driver.common">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.LPC54101_AND_component.lists_AND_driver.common_AND_utility.debug_console">
      <accept Dname="LPC54101J512*" Dvendor="NXP:11"/>
      <accept Dname="LPC54101J256*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC54101" Cversion="1.0.0" condition="device.LPC54101_AND_component.serial_manager_uart_AND_component.vusart_adapter_AND_device.LPC54101_startup_AND_driver.clock_AND_driver.common_AND_driver.lpc_gpio_AND_driver.lpc_iocon_AND_driver.power_AND_driver.vusart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.LPC54101_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.LPC54101_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.LPC54101_AND_driver.vusart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
